# ~/.Brewfile — the single source of truth for CLI tooling.
# Installed with `brew bundle --global` (run automatically by the chezmoi
# bootstrap, and any time: `brew bundle --global`).
#
# macOS-only for Homebrew tooling. Linux nodes use apt (see
# dot_config/dotfiles/apt-packages.txt). `cask` lines are macOS-only and
# guarded with `if OS.mac?`.
#
# ADD NEW TOOLING HERE — drop a `brew "name"` line, run `chezmoi apply` (or
# `brew bundle --global`), and never remember the install command again.

# NOTE: `vault` (the OpenBao-compatible client) is intentionally NOT here. It
# lives in hashicorp/tap (macOS) or HashiCorp's apt repo (Ubuntu) and is
# installed by an OS-aware step in run_onchange_after_10-install-packages.sh.tmpl.
# Keeping it out of the Brewfile avoids tap-trust friction so `brew bundle check` is clean.

# ---- Required: tooling this dotfiles setup depends on ----
brew "chezmoi"
brew "direnv"
brew "gitleaks"
brew "fzf"
brew "zoxide"
brew "bats-core"               # test runner for this repo

# ---- Everyday CLIs (the usual suspects) ----
brew "jq"                      # JSON processor
brew "yq"                      # YAML/JSON/XML processor
brew "figlet"                  # ASCII wordmark for the StumpCloud MOTD
brew "curl"
brew "vim"
brew "wget"
brew "gh"                      # GitHub CLI
brew "tea"                     # Gitea CLI (gitea.com/gitea/tea)
brew "chroma"                  # syntax highlighter — backend for the colorize plugin (conflict-free)
brew "signal-cli"              # Signal client; runs as a daemon (rocks.stump.signal-daemon) backing the Signal MCP
brew "qrencode"                # terminal QR for `signal-link` (link a new Signal device)
brew "tmux"                    # wraps the headless Crush signal-channel arbiter (crush-signal-channel service)
brew "uv"                      # Python runner — launches the Signal MCP (uv run --directory ~/src/signal-mcp)
brew "gum"                     # charm TUI toolkit — powers the `dot`/`theme`/`status` helpers
brew "eza"                     # modern ls — backend for the eza OMZ plugin (ls/ll/la aliases)
brew "go"                      # Go toolchain — builds the crush fork (run_after_30-install-crush) and enables go-tools.txt (GOTOOLCHAIN=auto fetches newer toolchains as go.mod demands)
# (vault — the OpenBao client — is installed OS-aware; see the note above.)

# ---- Optional: uncomment what you want; this is your "don't think about it"
#      list. Nothing below installs until you uncomment it. ----
# brew "ripgrep"
# brew "eza"
# brew "bat"
# brew "kubernetes-cli"
# brew "awscli"

# ---- macOS-only ----
cask "font-meslo-lg-nerd-font" if OS.mac?     # Nerd Font for spaceship / powerlevel10k glyphs
